{
  "title": "A Compendium of Quotes and Legal Rulings from Ala Hazrat (Imam Ahmed Raza Khan Barelwi)",
  "source": "Fatawa-e-Razawiyyah and other key works",
  "sections": [
    {
      "category": "Importance of Namaz (Prayer)",
      "quotes_list": [
        {
          "quote": "The first thing for which a servant will be held accountable on the Day of Judgment is prayer (`Salat`). If it is sound, then the rest of his deeds will be sound. If it is deficient, then the rest of his deeds will be deficient. This is because prayer is the pillar of the religion (`deen`), and whoever establishes the prayer establishes the religion, and whoever abandons it, abandons the religion.",
          "reference": "Reflection of a well-known Hadith, used frequently in the legal rulings on the status of prayer in `Fatawa-e-Razawiyyah`."
        },
        {
          "quote": "To abandon prayer intentionally is a sin more severe than all major sins combined, with the exception of disbelief (`kufr`). If a person misses a single prayer intentionally without a valid Shari'a excuse, then even if he performs `qada` (makes it up) for a thousand years, the sin of abandoning the original prayer on time will not be erased, though the `qada` will absolve him of the obligation.",
          "reference": "This strong statement is found in `Fatawa-e-Razawiyyah` when discussing the severity of `tark-e-salat` (abandoning prayer)."
        },
        {
          "quote": "The prayer is the means to achieve the pleasure of the Lord. The most beloved act to Allah after Iman is prayer. And a servant's closest proximity to his Lord is when he is in prostration (`sujood`). Therefore, do not allow any worldly matter to distract you from this greatest of blessings.",
          "reference": "A cornerstone of the section on `Salat` in `Fatawa-e-Razawiyyah`, particularly when discussing `khushu` (humility)."
        },
        {
          "quote": "For the one who intentionally misses prayer, the angels of the heavens and the earth curse him. His life becomes filled with hardship, and his sustenance loses its blessing. On the Day of Judgment, he will be raised with the likes of Pharaoh and Haman.",
          "reference": "A stern warning based on narrations and scholarly interpretations, found in his legal works to frighten people away from neglecting their prayers."
        },
        {
          "quote": "The difference between a believer and a non-believer is prayer. The one who has true faith will never abandon prayer, because prayer is the living manifestation of faith (`Iman`). As long as the prayer remains, so does the pillar of the `deen`.",
          "reference": "A recurring theme in his legal writings, which connects the inner state of `Iman` with the external act of `Salat`."
        }
      ]
    },
    {
      "category": "Permissibility of Dargah Visitation & Prohibition of Un-Islamic Acts",
      "quotes_list": [
        {
          "quote": "Visiting the graves of the pious saints (`Awliya`) is a highly recommended and blessed act. The purpose of this visit (`ziyarat`) is to seek blessings (`barakah`) from their presence and to benefit from their spiritual grace, which continues even after their physical death.",
          "reference": "Found in `Fatawa-e-Razawiyyah`, Volume 4, which provides detailed guidance on the etiquette of visiting `dargahs`."
        },
        {
          "quote": "To prostrate (`sajdah`) to anyone other than Allah, whether it is to a human, a saint, or a grave, is absolutely and unequivocally forbidden (`haram`). This act is the sole right of Allah, and anyone who commits it has committed a major sin and has gone astray from the path of Islam.",
          "reference": "A key quote from his treatise `az-Zubdah al-Zakiyyah`, which provides a definitive argument against prostration to graves."
        },
        {
          "quote": "Making a vow (`nadr`) is an act of worship (`ibadah`) and is valid only for Allah, the Almighty. It is forbidden to make a vow to any saint or grave. For example, to say, 'If my son gets well, I will give this goat to the saint,' is invalid and a form of `shirk`. The vow must be made to Allah, and the offering can then be given for the saint's sake.",
          "reference": "A consistent theme in his legal work, found in the section on vows in `Fatawa-e-Razawiyyah`."
        },
        {
          "quote": "All forms of music, dancing, playing of musical instruments, and excessive gatherings that go against the Shari'a are forbidden at the shrines of the saints. The purpose of visiting the graves is for spiritual benefit and remembrance of the Hereafter, not for worldly entertainment.",
          "reference": "Found in various volumes of `Fatawa-e-Razawiyyah` where he discusses permissible and impermissible customs."
        },
        {
          "quote": "To seek intercession with Allah through the blessed status of a saint is a valid and praiseworthy act. It is not worshiping the saint; rather, it is seeking Allah's mercy by using the `wasilah` (means) of His beloved servant. The saint is merely a door to Allah's mercy, and all power to grant a request rests with Allah alone.",
          "reference": "A central theological stance in his defense of shrine visitation, a recurring theme in his works like `Al-Ijazah al-Matina li-Tahseen al-Madina`."
        }
      ]
    },
    {
      "category": "What's Allowed at Shrines and Dargahs (Additional Quotes)",
      "quotes_list": [
        {
          "quote": "To visit the tombs of the pious and to make `dua` to Allah for the fulfillment of one's needs with the mediation (`wasilah`) of the saint is a permissible and praiseworthy act. The saint is not being worshipped; rather, he is being used as a noble means to gain Allah's favor, for their status in the sight of Allah is extremely high.",
          "reference": "This is a core theological principle of the Barelvi school, found in numerous places, including `Fatawa-e-Razawiyyah`."
        },
        {
          "quote": "The visit (`ziyarat`) to the graves of the `Awliya` (saints) is a means of spiritual elevation. A person can draw `barakah` (blessings) from the spiritual presence of the saint, which strengthens their faith, increases their humility, and reminds them of the impermanence of this world.",
          "reference": "This concept is a foundation of his rulings on the etiquette of visiting graves, detailed in the section on `Ziyarat-ul-Quboor` in `Fatawa-e-Razawiyyah`."
        },
        {
          "quote": "When visiting a blessed shrine, one should recite what is easy for them from the Quran, such as Surah Al-Fatiha, and `Durood Shareef` (prayers upon the Prophet). One should then offer the reward to the deceased saint and then make a `dua` to Allah with a humble heart. This is the correct and blessed manner of visiting the graves.",
          "reference": "This specific guidance on the sequence of actions at a shrine is provided in his fatwas in `Fatawa-e-Razawiyyah`, Volume 4."
        },
        {
          "quote": "The correct etiquette (`adab`) of visiting the grave of a saint is to approach from the foot side of the grave, stand a respectable distance away, and offer greetings (`salaam`) in a voice of humility. One should not rush or act in a manner that disrespects the sanctity of the place.",
          "reference": "This is part of his detailed instructions on `adab` found in `Fatawa-e-Razawiyyah` and other works."
        },
        {
          "quote": "The `Awliya` of Allah are not dead. Their bodies may be in the grave, but their souls are alive and active. They can hear the greetings of the visitors and can intercede with their Lord. The belief that the souls of the pious are alive and cognizant is an essential part of the creed of `Ahlus Sunnah Wal Jama'ah`.",
          "reference": "He wrote an entire monograph titled `Hayat al-Mawat fi Bayani Sama'il Amwat` to support this belief with evidence from the Quran and Hadith."
        }
      ]
    },
    {
      "category": "Milad un Nabi",
      "quotes_list": [
        {
          "quote": "In the bounty of Allah and His mercy, let them rejoice (`farah`). The Prophet Muhammad (Sallallahu Alaihi Wasallam) is the greatest mercy of Allah upon the worlds. Therefore, to rejoice on the day of his birth is not only permissible but is in accordance with the command of Allah in the Quran.",
          "reference": "This is a central argument used by Ala Hazrat to justify the celebration of Milad, based on Quran, Surah Yunus, verse 58."
        },
        {
          "quote": "The celebration of Milad un Nabi (`Mawlid`) is a praiseworthy and blessed innovation (`bid'ah hasanah`). It consists of acts that are themselves acts of worship, such as reciting the Quran, sending `Durood` (blessings) upon the Prophet, and providing food to the poor. The gathering of these virtuous acts is what makes the Milad a great deed.",
          "reference": "This ruling is part of his theological defense of the `Mawlid` tradition, found in his legal treatises and books."
        },
        {
          "quote": "The Prophet (peace be upon him) himself celebrated his own birth. It is narrated that he used to fast every Monday, and when asked why, he replied, 'That is the day on which I was born.' This is a clear proof from the Prophet's own Sunnah that the day of his birth is special and deserves to be commemorated.",
          "reference": "This is a famous Hadith from Sahih Muslim, which he and other scholars use to argue for the significance of the Prophet's birth date."
        },
        {
          "quote": "The celebration of Milad is an expression of the love for the Prophet, and a person's faith is incomplete without this love. By celebrating his birth, we remind ourselves and others of his immense favor upon humanity and re-ignite the flame of his love in our hearts.",
          "reference": "This principle is deeply intertwined with his overall emphasis on the importance of loving the Prophet, as articulated in `Tamheed-e-Imaan` and other works."
        },
        {
          "quote": "The one who spends a single dirham on the occasion of Milad un Nabi for the sake of Allah's pleasure will be rewarded with the treasure of paradise. The reward for this act is immense because it is done in honor of the one who is the greatest mercy to all the worlds.",
          "reference": "This is a quote attributed to him, often cited in books on the topic of Milad, reflecting his view that even simple acts of charity and joy on this day are highly rewarded."
        }
      ]
    },
    {
      "category": "Ala Hazrat's Position on Urs Celebration",
      "details": {
        "definition_of_urs": {
          "name": "Urs",
          "description": "An annual celebration commemorating the death anniversary of a Sufi saint. The name 'urs' comes from the Arabic word for 'wedding,' symbolizing the spiritual union of the saint's soul with God."
        },
        "summary": "Imam Ahmed Raza Khan Barelwi (Ala Hazrat) was a strong proponent of the Urs celebration, but he insisted it be performed according to Islamic law. He permitted certain acts while strictly forbidding others to purify the practice from what he considered un-Islamic customs.",
        "allowed_practices": [
          {
            "practice": "Commemoration and Quranic Recitation",
            "details": "Reciting the Quran, especially Surah Fatiha and Surah Yaseen, to send the spiritual reward (`sawaab`) to the deceased saint."
          },
          {
            "practice": "Sermons and Speeches",
            "details": "Giving talks on the saint's life, teachings, and spiritual rank to educate people and strengthen faith."
          },
          {
            "practice": "`Durood` and `Naat` Recitation",
            "details": "Reciting blessings upon the Prophet Muhammad (`Durood Shareef`) and poetic odes (`Naat`) in his praise."
          },
          {
            "practice": "Distribution of Food",
            "details": "Providing food (`Langar` or `Tabarruk`) to attendees and the poor as a form of charity."
          },
          {
            "practice": "Spiritual Connection",
            "details": "Seeking spiritual blessings (`barakah`) from the saint's presence and their intercession (`tawassul`) with Allah."
          }
        ],
        "forbidden_practices": [
          {
            "practice": "Prohibited Acts of Worship",
            "details": "Strictly forbidding any act that resembles prostration to the grave (`sajdah`) or circumambulation (`tawaf`) of the tomb, as these are reserved for Allah alone and the Kaaba, respectively."
          },
          {
            "practice": "Music and Dancing",
            "details": "Condemning the use of musical instruments, dancing, and singing that is against the Sharia, viewing them as worldly distractions."
          },
          {
            "practice": "Fireworks and Extravagance",
            "details": "Deeming the use of fireworks and firecrackers as a waste of money (`israf`) and forbidden in Islam."
          },
          {
            "practice": "Mixing of Genders",
            "details": "Insisting on the separation of men and women in public gatherings to maintain proper Islamic etiquette."
          }
        ]
      }
    }
  ]
}
