{
  "daily_remembrance": {
    "daily_dua": [
      {
        "title": "Supplication Before Sleeping",
        "arabic": "اللَّهُمَّ بِاسْمِكَ  أَمُوْتُ وَأَحْيَا",
        "latin": "allahumma bismika amuutu wa ahyaa",
        "translation": "In Your name, O Allah, I die and I live.",
        "notes": null,
        "benefits": "The Prophet, peace and blessings be upon him, always started and ended his day with dhikr.",
        "source": "HR. al-Bukhari"
      },
      {
        "title": "Supplication Upon Waking Up",
        "arabic": "الحَمْدُ للهِ الَّذِي أَحْيَانَا بعْدَ مَا أماتَنَا وإِلَيْهِ النُّشُورُ",
        "latin": "alhamdulillahilladzi ahyaanaa ba'da maa amaatanaa wa ilaihin nusyuur",
        "translation": "All praise is for Allah who gives us life after He has caused us to die, and to Him is the resurrection.",
        "notes": null,
        "benefits": "By reciting the supplication above, a servant begins his day by praising the name of Allah, the Giver of Life and the Bringer of Death.",
        "source": "HR. Bukhari: 6327"
      },	
      {
        "title": "Supplication Entering the Bathroom",
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
        "latin": "allahumma innii a'uudzubika minal khubutsi wal khabaaitsi",
        "translation": "O Allah, I seek refuge in You from the evil and the wicked.",
        "notes": null,
        "benefits": "This supplication acts as a barrier between a servant's private parts and the jinn when entering the bathroom.",
        "source": "HR. al-Bukhari and Muslim"
      },
      {
        "title": "Supplication Leaving the Bathroom",
        "arabic": "غُفْرَانَكَ",
        "latin": "ghuf-raanak",
        "translation": "I ask for Your forgiveness (O Allah).",
        "notes": null,
        "benefits": "The bathroom is one of the homes of the jinn and devils, so it is recommended to ask for forgiveness for any mistakes, intentional or unintentional, made while in the bathroom.",
        "source": "HR. at-Tirmidzi"
      },
      {
        "title": "Supplication Before Eating",
        "arabic": "بِسْمِ اللَّهِ",
        "latin": "bismillah",
        "translation": "In the name of Allah.",
        "notes": null,
        "benefits": "The benefit of reciting Bismillah before eating is to prevent Satan from joining humans in eating.",
        "source": "HR. al-Bukari No. 5376 and Muslim No. 2022"
      },
      {
        "title": "Supplication If Forgetting Bismillah at the Beginning of a Meal",
        "arabic": "بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ",
        "latin": "bismillahi awwaluhu wa aakhiruhu",
        "translation": "In the name of Allah, at its beginning and its end.",
        "notes": null,
        "benefits": "Islam pays great attention to etiquette. If someone forgets to recite the supplication before eating at the beginning, it is still recommended to recite it in the middle, even if there is only a spoonful of rice left.",
        "source": "HR. Abu Dawud"
      },
      {
        "title": "Supplication After Eating",
        "arabic": "الْحَمْدُ لِلَّهِ الَّذِى أَطْعَمَنِى هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلاَ قُوَّةٍ",
        "latin": "alhamdulillaahilladzii ath'amanii haadzaa wa rozaqoniihi min ghoiri haulin minnii wa laa quwwatin",
        "translation": "All praise is to Allah who has fed me this and provided for me without any power or strength from me.",
        "notes": null,
        "benefits": "The Messenger of Allah, peace and blessings be upon him, said that if someone recites this supplication, then his past sins will be forgiven.",
        "source": "Shahih at-Tirmidzi"
      },
      {
        "title": "Supplication Entering the Mosque",
        "arabic": "اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
        "latin": "allahummaftah lii abwaaba rahmatika",
        "translation": "O Allah, open the doors of Your mercy for me.",
        "notes": null,
        "benefits": "The mosque is the house of Allah; a servant should honor it and hope for Allah's mercy within it.",
        "source": "HR. Muslim"
      },
      {
        "title": "Supplication Leaving the Mosque",
        "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ",
        "latin": "allahumma innii as'aluka min fadhlika",
        "translation": "O Allah, I ask You for Your bounty.",
        "notes": null,
        "benefits": "Allah's earth is vast, and there are many ways to seek provision. A servant should ask for Allah's bounty to be facilitated in obtaining the provision that Allah has distributed to all His servants.",
        "source": "HR. Muslim No. 713"
      },
      {
        "title": "Supplication Before Performing Ablution",
        "arabic": "بِسْمِ اللَّهِ",
        "latin": "bismillah",
        "translation": "In the name of Allah.",
        "notes": null,
        "benefits": "It is prescribed to begin every important matter by saying Bismillah, whether it be an act of worship or otherwise.",
        "source": "HR. at-Tirmidzi and al-Baihaqi"
      },
      {
        "title": "Supplication After Performing Ablution",
        "arabic": "أشْهَدُ أنْ لا إله إِلاَّ اللَّهُ وَحْدَهُ لا شَرِيك لَهُ ، وأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ ، اللَّهُمَّ اجْعَلْنِي مِنَ التَوَّابِينَ ، واجْعَلْني مِنَ المُتَطَهِّرِينَ ، سُبْحانَكَ اللَّهُمَّ وبِحَمْدِكَ ، أشْهَدُ أنْ لا إلهَ إِلاَّ أنْتَ ، أسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ",
        "latin": "asyhadu an laa ilaaha illa allah wadahu laa syariika lahu, wa asyhadu anna muhammadan 'abduhu wa rasuuluhu. allahummaj 'alni minat tawwaabiina waj 'alnii minal mutathaahiriina. subhaanaka allahumma wa bihamdika asyhadu an laa ilaaha illa anta astaghfiruka wa atuubu ilaika",
        "translation": "I bear witness that there is no deity except Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger. O Allah, make me one of the repentant and make me one of the purified. Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You. I seek Your forgiveness and repent to You.",
        "notes": null,
        "benefits": "The Messenger of Allah, peace and blessings be upon him, said: 'Whoever performs wudu and then says this supplication, the eight gates of Paradise will be opened for him, and he may enter through whichever of them he wishes.'",
        "source": "HR. at-Tirmidzi"
      },
      {
        "title": "Dua Seeking Good In This World And In The Hereafter",
        "arabic": "رَبَّنَا آَتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآَخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "latin": "rabbana atina fi'd-dunya hasanatan wa fi'l-akhirati hasanatan wa qina 'adhaban-nar",
        "translation": "Our Lord! Give us good in this world that and give us good in the Hereafter, and save us from the torment of the hell fire.",
        "notes": null,
        "fawaid": "This dua is the dua most often said by the Prophet shallallahu 'alaihi wa sallam, as told by sahaba Anas bin Malik radhiallahu anhu.",
        "source": "QS. Al-Baqarah: 201, al-Bukhari: 6389, HR. Muslim: 2690"
      },
      {
        "title": "Dua To Make Heart Firm Upon Deen #1",
        "arabic": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِى عَلَى دِينِكَ",
        "latin": "ya muqallibal-qulubi thabbit qalbi 'ala deenika",
        "translation": "O Changer of the hearts, make my heart firm upon Your religion.",
        "notes": null,
        "fawaid": "A person's heart is between the fingers of Allah ta'ala, and He turns it back and forth according to his will. So we ask for steadfastness and firmness of heart on Allah's religion, Islam. This dua is narrated from Rasulullah shallallahu 'alaihi wa sallam who often read this supplication.",
        "source": "HR. at-Tirmidzi No. 2140"
      },
      {
        "title": "Dua To Make Heart Firm Upon Deen #2",
        "arabic": "يَا مُصَرِّفَ الْقُلُوبِ صَرِّفْ قَلْبِى عَلَى طَاعَتِكَ",
        "latin": "ya musarrifal-qulubi sarrif qalbi 'ala ta'atika",
        "translation": "O Turner of the hearts, turn my heart towards Your obedience.",
        "notes": null,
        "fawaid": "This dua is recited to ask Allah to turn our hearts towards obedience and worship, not away from it. This dua is also narrated from Rasulullah shallallahu 'alaihi wa sallam.",
        "source": "HR. Muslim No. 2654"
      },
      {
        "title": "Dua Seeking Protection From Various Evils",
        "arabic": "اَللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ",
        "latin": "allahumma inni a'udhu bika minal-fitani ma zahara minha wa ma batan",
        "translation": "O Allah, I seek refuge in Thee from trials, both what is apparent of them and what is concealed.",
        "notes": null,
        "fawaid": "This is a prayer that Rasulullah shallallahu 'alaihi wa sallam taught to his companions. It is said that at the time of the Prophet, he heard that there would be many trials and disasters in the future, so he recited this prayer and taught it to his companions.",
        "source": "HR. Muslim No. 2867"
      },
      {
        "title": "Dua For Good Manners",
        "arabic": "اَللَّهُمَّ اهْدِنِى لِأَحْسَنِ الأَخْلاَقِ لاَ يَهْدِى لِأَحْسَنِهَا إِلاَّ أَنْتَ وَاصْرِفْ عَنِّى سَيِّئَهَا لاَ يَصْرِفُ عَنِّى سَيِّئَهَا إِلاَّ أَنْتَ",
        "latin": "allahumma ihdini li ahsanil-akhlaqi la yahdi li ahsaniha illa anta, wasrif 'anni sayyi'aha la yasrifu 'anni sayyi'aha illa anta",
        "translation": "O Allah, guide me to the best of manners, for none can guide to them but You. And turn away from me the worst of manners, for none can turn them away but You.",
        "notes": null,
        "fawaid": "Narrated by 'Aisha radhiallahu anha, that Rasulullah shallallahu 'alaihi wa sallam prayed with this prayer. This prayer is for asking for the best morals because noble morals are the foundation of Islam and the core of the perfection of a person's faith. Rasulullah shallallahu 'alaihi wa sallam himself came to perfect morals. So, we, as His followers, must ask for the best of morals as well.",
        "source": "HR. Muslim: 771"
      },
      {
        "title": "Dua for Forgiveness",
        "arabic": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
        "latin": "allahumma innaka 'afuwwun tuhibbul-'afwa fa'fu 'anni",
        "translation": "O Allah, You are the Forgiver, and You love forgiveness, so forgive me.",
        "notes": "This is a prayer that the Prophet Muhammad taught to his wife, 'Aisha, for Laylatul Qadr (the Night of Power).",
        "fawaid": "Forgiveness is a virtue that Allah loves. By asking for it, we acknowledge our dependence on Allah's mercy and His power to forgive our sins. This prayer is particularly powerful during the last ten nights of Ramadan, especially on Laylatul Qadr, a night of immense blessings and rewards.",
        "source": "HR. at-Tirmidzi No. 3513, Ibn Majah No. 3850, and Musnad Ahmad No. 25384"
      },
      {
        "title": "Dua For Protection from the Evil of All That Allah Has Created",
        "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "latin": "'audhu bikalimaatil-laahit-taammaati min sharri maa khalaq",
        "translation": "I seek refuge in the perfect words of Allah from the evil of that which He has created.",
        "notes": null,
        "fawaid": "This prayer is a powerful tool to seek Allah's protection from all kinds of harm, whether from jinn, humans, animals, or any other creation. It is a reminder that only Allah can protect us from evil.",
        "source": "HR. Muslim No. 2708"
      },
      {
        "title": "Dua for Protection from Laziness, Debt, And Pressure from Others",
        "arabic": "اَللّٰهُمَّ إِنِّى أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحَزْنِ وَأَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَأَعُوْذُبِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوْذُبِكَ مِنْ غَلَبَتِ الدَّيْنِ وَقَهْرِ الرجال",
        "latin": "allahumma inni a'oodhu bika minal-hammi wal-huzni wa a'oodhu bika minal-'ajzi wal-kasali wa a'oodhu bika minal-jubni wal-bukhli wa a'oodhu bika min ghalabatid-dayni wa qahrir-rijal",
        "translation": "O Allah, I seek refuge in Thee from care and grief, I seek refuge in Thee from incapacity and slackness, I seek refuge in Thee from cowardice and niggardliness, and I seek in Thee from being overcome by debt and being put in subjection by men.",
        "notes": null,
        "fawaid": "A noble sahaba, Abu Umamah, who narrated this hadith, said: after I practiced this prayer, Allah completely removed my confusion and gave me the ability to pay off debts.",
        "source": "HR. Abu Dawud No. 1555"
      },
      {
        "title": "Dua When Getting Good News",
        "arabic": "الْحَمْدُ لِلَّهِ الَّذِى بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
        "latin": "alhamdulillahilladhi bini'matihi tatimmus-salihat",
        "translation": "Praise be to Allah, by Whose grace righteous deeds are completed.",
        "notes": null,
        "fawaid": "This prayer is said when a Muslim receives good news. It is a way of showing gratitude and appreciation to Allah for His blessings and mercy. It also reminds us that all good things come from Allah and that we should always be grateful to Him.",
        "source": "HR. Ibn Majah No. 3803"
      },
      {
        "title": "Dua When Something Bad Happens",
        "arabic": "الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
        "latin": "alhamdulillah 'ala kulli hal",
        "translation": "Praise be to Allah in every situation.",
        "notes": null,
        "fawaid": "This prayer is said when a Muslim is afflicted with a calamity or misfortune. It is a way of showing patience and acceptance of Allah's decree. It also reminds us that even in difficult times, we should always be grateful to Allah and trust in His wisdom.",
        "source": "HR. Ibn Majah No. 3803"
      },
      {
        "title": "Dua For The Best Of The Deen And The World",
        "arabic": "اللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي وَأَصْلِحْ لِي آخِرَتِيَ الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
        "latin": "allahumma aslih li diniyyalladhi huwa 'ismatu amri, wa aslih li dunyayallati fiha ma'ashi, wa aslih li akhiratiyallati fiha ma'adi, waj'alil-hayata ziyadatan li fi kulli khair, waj'alil-mawtah rahatan li min kulli sharr",
        "translation": "O Allah, make my religion sound, which is the safeguard of my affairs, and make my worldly life sound, in which is my livelihood, and make my hereafter sound, to which is my return; and make life a source of abundance for me in all that is good, and make death a rest for me from all that is evil.",
        "notes": null,
        "fawaid": "This prayer encompasses all aspects of a person's life, from their religion to their worldly affairs and the hereafter. It is a comprehensive prayer that asks Allah for guidance, sustenance, and protection in all situations.",
        "source": "HR. Muslim No. 2720"
      },
      {
        "title": "Dua For Forgiveness",
        "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
        "latin": "rabbana-ghfir-li wa-liwalidaiyya wa-lil-mu'minina yauma yaqumul-hisab",
        "translation": "Our Lord, forgive me and my parents and all the believers on the Day the account is established.",
        "notes": "This is a prayer of Prophet Ibrahim (peace be upon him), teaching us to honor and love our parents, remember the Day of Judgment, and care for fellow believers.",
        "fawaid": "This prayer is a reminder of the importance of seeking forgiveness for ourselves, our parents, and all believers. It also teaches us to remember the Day of Judgment and to prepare for it by seeking Allah's forgiveness and mercy.",
        "source": "QS. Ibrahim: 41"
      }
    ],
    "dhikr_after_salah": [
      {
        "title": "Istighfar",
        "arabic": "أَسْتَغْفِرُ اللَّهَ",
        "latin": "astagh-firullah",
        "translation": "I seek forgiveness from Allah.",
        "notes": "Read 3x",
        "benefits": "When the Messenger of Allah, peace and blessings be upon him, finished his prayer, he would seek forgiveness three times and recite the dhikr above. Al-Auza'i stated that the recitation of istighfar is 'Astaghfirullah, Astaghfirullah.'",
        "source": "HR. Muslim No. 591"
      },
      {
        "title": "Allah, The Giver of Peace",
        "arabic": "اَللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَاْلإِكْرَامِ",
        "latin": "allahumma antas salaam wa minkas salaam tabaarokta ya dzal jalaali wal ikrom",
        "translation": "O Allah, You are Peace, and from You is peace. Blessed are You, O Possessor of majesty and honor.",
        "notes": "Read 1x",
        "benefits": "When the Messenger of Allah, peace and blessings be upon him, finished his prayer, he would seek forgiveness three times and recite the dhikr above. Al-Auza'i stated that the recitation of istighfar is 'Astaghfirullah, Astaghfirullah.'",
        "source": "HR. Muslim No. 591"
      },
      {
        "title": "Allah, The Preventer and The Giver of All Things",
        "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ، اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
        "latin": "laa ilaha illallah wahdahu laa syarika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir. allahumma laa maani'a lima a'thoita wa laa mu'thiya limaa mana'ta wa laa yanfau dzal jaddi minkal jaddu",
        "translation": "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent. O Allah, there is no preventer of what You give, and no giver of what You withhold, and wealth and honor do not benefit their possessor (except faith and righteous deeds that save from punishment). Only from You is wealth and honor.",
        "notes": "Read 1x",
        "benefits": null,
        "source": "HR. Bukhari No. 844 and Muslim No. 593"
      },
      {
        "title": "Allah, The Possessor of All and The Only One Worthy of Worship",
        "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ، لاَ إِلَـهَ إِلاَّ اللهُ وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّـنَاءُ الْحَسَنُ، لاَ إِلَـهَ إِلاَّ اللهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُوْنَ",
        "latin": "laa ilaha illallah wahdahu laa syarika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir. wa laa haula wa laa quwwata illa billah. laa ilaha illallah wa laa na'budu illa iyyah. lahun ni'matu wa lahul fadhlu wa lahuts tsanaa-ul hasan. laa ilaha illallah mukhlishiina lahud diin wa lau karihal kaafiruun",
        "translation": "There is no deity worthy of worship except Allah alone, He has no partner. To Him belongs dominion and praise, and He is over all things competent. And there is no power or strength except with Allah. There is no deity worthy of worship except Allah, and we do not worship except Him. To Him belong all blessings, grace, and all good praise. There is no deity worthy of worship except Allah, making the religion purely for Him, even if the disbelievers dislike it.",
        "notes": "Read 1x",
        "benefits": null,
        "source": "HR. Muslim No. 594"
      },
      {
        "title": "Subhanallah, Alhamdulillah, Allahu Akbar",
        "arabic": "سُبْحَانَ اللَّهِ (33x), اَلْحَمْدُ لِلَّهِ (33x), اَللَّهُ أَكْبَرُ (33x)",
        "latin": "subhanallah, alhamdulillah, allahu akbar",
        "translation": "Glory be to Allah, All praise is for Allah, Allah is the Greatest.",
        "notes": "Read 33x each, after which recite 'Laa ilaha illallahu wahdahu laa syarika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai-in qodiir' 1x.",
        "benefits": "Whoever says Subhanallah 33 times, Alhamdulillah 33 times, and Allahu Akbar 33 times, then completes it with Laa ilaha illallah..., his sins will be forgiven even if they are like the foam of the sea.",
        "source": "HR. Muslim No. 597"
      },
      {
        "title": "Ayat al-Kursi",
        "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
        "latin": "allahu la ilaha illa huwa, al-hayyul-qayyum. la ta'khudhuhu sinatun wa la nawm. lahu ma fis-samawati wa ma fil-ard. man dhal-ladhi yashfa'u 'indahu illa bi-idhnihi. ya'lamu ma bayna aydihim wa ma khalfahum. wa la yuhiytuna bishay'in min 'ilmihi illa bima shaa'. wa si'a kursiyyuhu as-samawati wal-ard. wa la ya'udu-hu hifdhuhuma. wa huwa al-'aliyyul-'azim",
        "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most Hight, the Most Great.",
        "notes": "Read 1x",
        "benefits": "Whoever recites this verse after every obligatory prayer, nothing will prevent him from entering Paradise except death.",
        "source": "HR. An-Nasa'i"
      },
      {
        "title": "Al-Ikhlas",
        "arabic": "قُلْ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (4)",
        "latin": "qul huwallāhu aḥad (1) allāhuṣ-ṣamad (2) lam yalid wa lam yụlad (3) wa lam yakul lahụ kufuwan aḥad (4)",
        "translation": "Say, \"He is Allah , [who is] One, (1) Allah , the Eternal Refuge. (2) He neither begets nor is born, (3) Nor is there to Him any equivalent.\" (4)",
        "notes": "Read 1x",
        "benefits": "Whoever recites this verse and the two surahs after it (Al-Falaq and An-Naas) after every obligatory prayer, they will be protected from all evil.",
        "source": "HR. Abu Dawud No. 1523 and an-Nasa'i No. 1337"
      },
      {
        "title": "Al-Falaq",
        "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
        "latin": "qul a'ụżu birabbil-falaq (1) min syarri mā khalaq (2) wa min syarri gāsiqin iżā waqab (3) wa min syarrin-naffāṡāti fil-'uqad (4) wa min syarri ḥāsidin iżā ḥasad (5)",
        "translation": "Say, \"I seek refuge in the Lord of daybreak (1) From the evil of that which He created (2) And from the evil of darkness when it settles (3) And from the evil of the blowers in knots (4) And from the evil of an envier when he envies.\" (5)",
        "notes": "Read 1x",
        "benefits": "Whoever recites this verse and the two surahs after it (Al-Falaq and An-Naas) after every obligatory prayer, they will be protected from all evil.",
        "source": "HR. Abu Dawud No. 1523 and an-Nasa'i No. 1337"
      },
      {
        "title": "An-Naas",
        "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (4) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (6)",
        "latin": "qul a'ụżu birabbin-nās (1) malikin-nās (2) ilāhin-nās (3) min syarril-waswāsil-khannās (4) allażī yuwaswisu fī ṣudụrin-nās (5) minal-jinnati wan-nās (6)",
        "translation": "Say, \"I seek refuge in the Lord of mankind, (1) The King of mankind. (2) The God of mankind, (3) From the evil of the whisperer who withdraws, (4) Who whispers in the breasts of mankind, (5) Of the jinn and mankind.\" (6)",
        "notes": "Read 1x",
        "benefits": "Whoever recites this verse and the two surahs after it (Al-Falaq and An-Naas) after every obligatory prayer, they will be protected from all evil.",
        "source": "HR. Abu Dawud No. 1523 and an-Nasa'i No. 1337"
      },
      {
        "title": "Supplication for Beneficial Knowledge, Good Provision, and Accepted Deeds",
        "arabic": "اللَّهُمَّ إِنِّى أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
        "latin": "allahumma innii as-aluka 'ilman naafi'a, wa rizqan thayyiba, wa 'amalan mutaqabbala",
        "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds.",
        "notes": "Read 1x after the salam of Fajr prayer",
        "benefits": "Beneficial knowledge is a provision that makes life easier, obtaining good provision is a person's goal in working, and accepted deeds are the goal of every worship. This prayer is comprehensive, asking for the best of this world and the hereafter. This prayer is taught by the Prophet Muhammad.",
        "source": "HR. Ahmad and Ibn Majah"
      },
      {
        "title": "Oh Allah You are my Lord!",
        "arabic": "اَلّلهُمَّ أنْتَ رَبِّيْ لَا اِلهَ اِلَّا أَنْتَ",
        "latin": "Allahumma Anta Rabbi, La-ilaha illa Anta",
        "translation": "Oh Allah You are my Lord! None has the right to be worshipped except You",
        "notes": null,
        "benefits": null,
        "source": null
      },
      {
        "title": "You created me. And I am your servant.",
        "arabic": "خَلَقْتَنِيْ وَأَنَا عَبْدُكَ وَأَنَا عَلى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ",
        "latin": "Khalaqtani wa ana ‘abduka, wa ana a’la a’hdika wa wa’dika mastata’tu",
        "translation": "You created me. And I am your servant. And I stand by your covenant and promise",
        "notes": null,
        "benefits": null,
        "source": null
      },
      {
        "title": "I seek refuge with You from all the evil I have committed",
        "arabic": "أَعُوْذُبِكَ مِنْ شَرِّ مَا صَنَعْتُ",
        "latin": "a’udhu bika min sharri maa sana’tu",
        "translation": "I seek refuge with You from all the evil I have committed",
        "notes": null,
        "benefits": null,
        "source": null
      },
      {
        "title": "I acknowledge before You all the blessings You have bestowed upon me and I confess to You all my sins",
        "arabic": "أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِيْ",
        "latin": "abuo-u laka bini’matika a’laiya, wa abuo-u bidhanbii",
        "translation": "I acknowledge before You all the blessings You have bestowed upon me and I confess to You all my sins",
        "notes": null,
        "benefits": null,
        "source": null
      },
      {
        "title": "Forgive all my sins. Surely none can forgive sins except you.",
        "arabic": "فَاغْفِرْ لِيْ ذُنُوْبِىْ فَاِنَّهُ لَا يَغْفِرُ الذُّنُوْبَ اِلَّا أَنْتَ",
        "latin": "faghfir li dhunubi fainnahu la yaghfiru dhunuba illa anta",
        "translation": "Forgive all my sins. Surely none can forgive sins except you.",
        "notes": null,
        "benefits": null,
        "source": null
      }
    ],
    "evening_dhikr": [
      {
        "title": "Ayat al-Kursi",
        "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
        "latin": "Allāhu lā ilāha illā huw, al-ḥayyul-qayyụm, lā ta`khużuhụ sinatuw wa lā na`ụm, lahụ mā fis-samāwāti wa mā fil-arḍ, man żallażī yasyfa'u 'indahū illā bi`iżnih, ya'lamu mā baina aidīhim wa mā khalfahum, wa lā yuḥīṭụna bisyai`im min 'ilmihī illā bimā syā`, wasi'a kursiyyuhus-samāwāti wal-arḍ, wa lā ya`ụduhụ ḥifẓuhumā, wa huwal-'aliyyul-'aẓīm",
        "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
        "notes": "Read 1x",
        "benefits": "Whoever recites this verse in the morning will be protected until the evening. And whoever recites it in the evening will be protected until the morning.",
        "source": "HR. at-Tirmidzi: 2879"
      },
      {
        "title": "Al-Ikhlas",
        "arabic": "قُلْ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (4)",
        "latin": "qul huwallāhu aḥad (1) allāhuṣ-ṣamad (2) lam yalid wa lam yụlad (3) wa lam yakul lahụ kufuwan aḥad (4)",
        "translation": "Say, \"He is Allah , [who is] One, (1) Allah , the Eternal Refuge. (2) He neither begets nor is born, (3) Nor is there to Him any equivalent.\" (4)",
        "notes": "Read 3x",
        "benefits": "The Messenger of Allah, peace and blessings be upon him, said: Recite Qul huwallahu ahad, and Al-Mu'awwidhatayn (Al-Falaq and An-Nas) in the evening and morning three times, and it will suffice you (protect you) from everything.",
        "source": "HR. Abu Dawud No. 4241"
      },
      {
        "title": "Al-Falaq",
        "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
        "latin": "qul a'ụżu birabbil-falaq (1) min syarri mā khalaq (2) wa min syarri gāsiqin iżā waqab (3) wa min syarrin-naffāṡāti fil-'uqad (4) wa min syarri ḥāsidin iżā ḥasad (5)",
        "translation": "Say, \"I seek refuge in the Lord of daybreak (1) From the evil of that which He created (2) And from the evil of darkness when it settles (3) And from the evil of the blowers in knots (4) And from the evil of an envier when he envies.\" (5)",
        "notes": "Read 3x",
        "benefits": "The Messenger of Allah, peace and blessings be upon him, said: Recite Qul huwallahu ahad, and Al-Mu'awwidhatayn (Al-Falaq and An-Nas) in the evening and morning three times, and it will suffice you (protect you) from everything.",
        "source": "HR. Abu Dawud No. 4241"
      },
      {
        "title": "An-Naas",
        "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (4) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (6)",
        "latin": "qul a'ụżu birabbin-nās (1) malikin-nās (2) ilāhin-nās (3) min syarril-waswāsil-khannās (4) allażī yuwaswisu fī ṣudụrin-nās (5) minal-jinnati wan-nās (6)",
        "translation": "Say, \"I seek refuge in the Lord of mankind, (1) The King of mankind. (2) The God of mankind, (3) From the evil of the whisperer who withdraws, (4) Who whispers in the breasts of mankind, (5) Of the jinn and mankind.\" (6)",
        "notes": "Read 3x",
        "benefits": "The Messenger of Allah, peace and blessings be upon him, said: Recite Qul huwallahu ahad, and Al-Mu'awwidhatayn (Al-Falaq and An-Nas) in the evening and morning three times, and it will suffice you (protect you) from everything.",
        "source": "HR. Abu Dawud No. 4241"
      },
      {
        "title": "Praise to Allah",
        "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ",
        "latin": "amsaynaa wa amsal mulku lillah",
        "translation": "We have reached the evening, and in the evening all sovereignty belongs to Allah.",
        "notes": null,
        "benefits": "This is a supplication that is recited in the evening to acknowledge Allah's sovereignty and to seek His protection for the night.",
        "source": "HR. Muslim No. 2723"
      },
      {
        "title": "Praise to Allah",
        "arabic": "الْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "latin": "alhamdulillah, la ilaha illallahu wahdahu la syarika lah, lahul mulku wa lahul hamdu, wa huwa 'ala kulli syai-in qadir",
        "translation": "All praise is for Allah, there is no deity except Allah alone, He has no partner. To Him belongs all sovereignty and praise, and He is over all things competent.",
        "notes": null,
        "benefits": "This is a supplication of praise and thanks to Allah for His blessings and mercy. It is a reminder that all good things come from Allah and that we should always be grateful to Him.",
        "source": "HR. Muslim No. 2723"
      },
      {
        "title": "Supplication for Protection from the Evil of Satan and the Desires of the Nafs",
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذِهِ اللَّيْلَةِ وَشَرِّ مَا فِيهَا وَشَرِّ مَا بَعْدَهَا",
        "latin": "allahumma inni as-aluka khaira hadzihil lailati wa khaira ma fiha wa khaira ma ba'daha, wa a'udzu bika min syarri hadzihil lailati wa syarri ma fiha wa syarri ma ba'daha",
        "translation": "O Allah, I ask You for the good of this night, the good of what is in it, and the good of what comes after it. And I seek refuge in You from the evil of this night, the evil of what is in it, and the evil of what comes after it.",
        "notes": null,
        "benefits": "This is a comprehensive supplication that asks for Allah's protection from all kinds of evil, both from within and from outside. It is a reminder that we are weak and that we need Allah's help to overcome our desires and the evil of Satan.",
        "source": "HR. Muslim No. 2723"
      },
      {
        "title": "Seeking Forgiveness 100 Times a Day",
        "arabic": "أَسْتَغْفِرُ الله وَأَتُوْبُ إِلَيْهِ",
        "latin": "astagh-firullah wa atuubu ilaih",
        "translation": "I seek forgiveness from Allah and repent to Him.",
        "notes": "Read 100x daily",
        "benefits": "Ibn 'Umar said: The Messenger of Allah, peace and blessings be upon him, said: 'O people, repent to Allah, for indeed I repent to Him one hundred times a day.'",
        "source": "HR. al-Bukhari/Fat-hul Baari XI/101 and Muslim No. 2702"
      },
      {
        "title": "Prayer for Protection from the Evil of Allah's Creation",
        "arabic": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّآمَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "latin": "'audzu bi kalimaatillahittaamaati min syarri ma khalaq",
        "translation": "I seek refuge in the perfect words of Allah from the evil of that which He created.",
        "notes": null,
        "benefits": "This supplication is to seek refuge from the evil of all that Allah has created, including jinn, humans, and animals. It is a powerful tool to seek Allah's protection and to remind ourselves that only Allah can protect us from evil.",
        "source": "HR. Muslim No. 2708"
      }
    ],
    "morning_dhikr": [
      {
        "title": "Virtues and Benefits Subhanallahi Wa Bihamdihi Hadith",
        "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ العَظِيم أَسْتَغْفِرُ الله",
        "latin": "Subhanallahi wa bihamdihi Subhanallahil azeem Subhanallahil azeem",
        "translation": "Glory be to Allah and all praise is due to Him, Glory be to Allah, the Great,I seek forgiveness from Allah.",
        "notes": "Recite 100x",
        "fawaid": "Narrated Abu Huraira: Allah’s Messenger (ﷺ) said, “Whoever says, ‘Subhan Allah wa bihamdihi,’ one hundred times a day, will be forgiven all his sins even if they were as much as the foam of the sea.",
        "source": ""
      },
      {
        "title": "Ayatul Kursi",
        "arabic": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُۥ مَا فِى ٱلسَّمَٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
        "latin": "allahu la ilaha illa huwa, al-hayyul-qayyum. la ta'khudhuhu sinatun wa la nawm. lahu ma fis-samawati wa ma fil-ard. man dhal-ladhi yashfa'u 'indahu illa bi-idhnihi. ya'lamu ma bayna aydihim wa ma khalfahum. wa la yuhiytuna bishay'in min 'ilmihi illa bima shaa'. wa si'a kursiyyuhu as-samawati wal-ard. wa la ya'udu-hu hifdhuhuma. wa huwa al-'aliyyul-'azim",
        "translation": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most Hight, the Most Great.",
        "notes": "Recite 1x",
        "fawaid": "Whoever reads this verse in the morning, he will be protected until evening. And whoever reads it in the evening, he will be protected until morning.",
        "source": "HR. at-Tirmidzi: 2879"
      },
      {
        "title": "Al-Ikhlas",
        "arabic": "قُلْ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ (4)",
        "latin": "qul huwa allahu ahad (1) allahu samad (2) lam yalid wa lam yulad (3) wa lam yakun lahu kufuwan ahad (4)",
        "translation": "Say, O Prophet, He is Allah - One and Indivisible (1) Allah - the Sustainer needed by all (2) He has never had offspring, nor was He born (3) And there is none comparable to Him (4).",
        "notes": "Recite 3x",
        "fawaid": "Rasulullah shallallahu 'alaihi wa sallam said: Say (read the surahs), Qulhuwallahu ahad, and Al-Muawwidzatain (Al-Falaq & An-Naas) three times in the evening and morning, then these verses will suffice you (guard you) from evening.",
        "source": "HR. Abu Dawud No. 4241"
      },
      {
        "title": "Al-Falaq",
        "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
        "latin": "qul a'udhu birabbil-falaq (1) min sharri ma khalaq (2) wa min sharri ghaasiqin idha waqab (3) wa min sharri naffathati fil-'uqad (4) wa min sharri hasidin idha hasad (5)",
        "translation": "Say, O Prophet, I seek refuge in the Lord of the daybreak (1) from the evil of whatever He has created (2) and from the evil of the night when it grows dark (3) and from the evil of those ˹witches casting spells by˺ blowing onto knots (4) and from the evil of an envier when they envy (5)",
        "notes": "Recite 3x",
        "fawaid": "Rasulullah shallallahu 'alaihi wa sallam said: Say (read the surahs), Qulhuwallahu ahad, and Al-Muawwidzatain (Al-Falaq & An-Naas) three times in the evening and morning, then these verses will suffice you (guard you) from evening.",
        "source": "HR. Abu Dawud No. 4241"
      },
      {
        "title": "An-Naas",
        "arabic": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ (4) ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ (6)",
        "latin": "qul a'udhu birabbin-nas (1) malikin-nas (2) ilahin-nas (3) min sharril-waswasil-khannas (4) alladhi yuwaswisu fi sudurin-nas (5) minal-jinnati wan-nas (6)",
        "translation": "Say, O Prophet, I seek refuge in the Lord of mankind (1) the King of mankind (2) the God of mankind (3) from the evil of the slinking whisperer (4) who whispers into the hearts of mankind (5) from among the jinn and mankind (6).",
        "notes": "Recite 3x",
        "fawaid": "Rasulullah shallallahu 'alaihi wa sallam said: Say (read the surahs), Qulhuwallahu ahad, and Al-Muawwidzatain (Al-Falaq & An-Naas) three times in the evening and morning, then these verses will suffice you (guard you) from evening.",
        "source": "HR. Abu Dawud No. 4241"
      },
      {
        "title": "Prayer for entering the morning with faith",
        "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَعَلَى كَلِمَةِ الْإِخْلَاصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
        "latin": "asbahna 'ala fitratil-islam wa 'ala kalimatil-ikhlas wa 'ala dini nabiyyina muhammadin sallallahu 'alaihi wa sallam wa 'ala millati abina ibrahima hanifan musliman wa ma kana minal-mushrikin",
        "translation": "We have entered the morning upon the natural state of Islam, upon the word of sincerity, upon the religion of our Prophet Muhammad (peace and blessings be upon him), and upon the faith of our father Ibrahim, who was a pure monotheist and not of the polytheists.",
        "notes": "Recite 1x",
        "fawaid": "By reciting this prayer, we declare our faith and commitment to Allah and His Messenger. It is a powerful reminder of our purpose in life and our connection to the prophets of Allah. This prayer is also a way to ask Allah for guidance and steadfastness in our religion.",
        "source": "HR. Ahmad and Ibn Majah"
      },
      {
        "title": "Supplication for the well-being of the world and the hereafter",
        "arabic": "اَللَّهُمَّ إِنِّي أَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ، فَأَتِمَّ عَلَيَّ نِعْمَتَكَ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالآخِرَةِ",
        "latin": "allahumma inni asbahtu minka fi ni'matin wa 'afiyatin wa sitr, fa-atimma 'alayya ni'mataka wa 'afiyataka wa sitraka fid-dunya wal-akhirah",
        "translation": "O Allah, I have entered the morning with Your blessings, well-being, and concealment (of sins). So complete Your blessings, Your well-being, and Your concealment upon me in this world and the Hereafter.",
        "notes": "Recite 3x",
        "fawaid": "This prayer is a way of expressing gratitude to Allah for His countless blessings and mercy. It is also a reminder that we should always seek Allah's help and protection in all aspects of our lives, both in this world and the hereafter.",
        "source": "HR. at-Tirmidzi No. 3514"
      },
      {
        "title": "Daily Tasbih and Tahmid",
        "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
        "latin": "subhanallah wa bihamdihi",
        "translation": "Glory be to Allah, I praise Him.",
        "notes": "Recite 100x",
        "fawaid": "Whoever says the phrase 'subhanallah wa bi hamdih' in the morning and evening 100 times, then no one will come on the Day of Judgement that is better than what he did except the person who said something like or more thant that.",
        "source": "HR. Muslim No. 2691 and No. 2692, from Abu Hurairah radhiyallahu 'anhu Syarah Muslim XVII/17-18, Shahiih at-Targhiib wat Tarhiib 1/413 No. 653"
      },
      {
        "title": "Istighfar 100x a Day",
        "arabic": "أَسْتَغْفِرُ الله وَأَتُوْبُ إِلَيْهِ",
        "latin": "astagh-firullah wa atuubu ilaih",
        "translation": "I seek forgiveness from Allah and repent to Him.",
        "notes": "Recite 100x daily",
        "fawaid": "Ibn 'Umar said: The Messenger of Allah, peace and blessings be upon him, said: 'O people, repent to Allah, for indeed I repent to Him one hundred times a day.'",
        "source": "HR. al-Bukhari/Fat-hul Baari XI/101 and Muslim No. 2702"
      }
    ]
  }
}