[
  {
    "arabic": "آدم",
    "urdu": "آدم",
    "transliteration": "Adam",
    "english_intro": "The first man and the first prophet sent by God, the father of humanity.",
    "urdu_intro": "اللہ کے بھیجے ہوئے سب سے پہلے انسان اور پہلے نبی، جو انسانیت کے باپ ہیں۔"
  },
  {
    "arabic": "إدريس",
    "urdu": "ادریس",
    "transliteration": "Idris (Enoch)",
    "english_intro": "Known for his wisdom and knowledge, often associated with early writing and science.",
    "urdu_intro": "اپنی حکمت اور علم کے لیے جانے جاتے ہیں۔ یہ ابتدائی تحریر اور سائنس سے منسوب ہیں۔"
  },
  {
    "arabic": "نوح",
    "urdu": "نوح",
    "transliteration": "Nuh (Noah)",
    "english_intro": "The prophet who built the Ark to save the believers and pairs of all living creatures from the Great Flood.",
    "urdu_intro": "وہ نبی جنہوں نے طوفانِ نوح سے مومنوں اور تمام جانداروں کے جوڑوں کو بچانے کے لیے کشتی (سفینہ) بنائی۔"
  },
  {
    "arabic": "هود",
    "urdu": "ہود",
    "transliteration": "Hud (Eber)",
    "english_intro": "Sent to the people of 'Ad, who were known for their arrogance and great strength.",
    "urdu_intro": "قومِ عاد کی طرف بھیجے گئے، جو اپنے غرور اور زبردست طاقت کے لیے مشہور تھے۔"
  },
  {
    "arabic": "صالح",
    "urdu": "صالح",
    "transliteration": "Salih",
    "english_intro": "Sent to the people of Thamud, who famously carved their homes into mountainsides. His miracle was a she-camel.",
    "urdu_intro": "قومِ ثمود کی طرف بھیجے گئے، جو پہاڑوں کو تراش کر گھر بنانے کے لیے مشہور تھے۔ ان کا معجزہ ایک اونٹنی تھی۔"
  },
  {
    "arabic": "إبراهيم",
    "urdu": "ابراہیم",
    "transliteration": "Ibrahim (Abraham)",
    "english_intro": "Known as the 'Father of Prophets,' he championed pure monotheism and is central to all three Abrahamic faiths.",
    "urdu_intro": "'انبیاء کے باپ' کے نام سے جانے جاتے ہیں، انہوں نے خالص توحید کی حمایت کی اور تینوں ابراہیمی مذاہب میں مرکزی حیثیت رکھتے ہیں۔"
  },
  {
    "arabic": "لوط",
    "urdu": "لوط",
    "transliteration": "Lut (Lot)",
    "english_intro": "The prophet sent to the people of Sodom and Gomorrah, warning them against immorality.",
    "urdu_intro": "سدوم اور عمورہ کے لوگوں کی طرف بھیجے گئے نبی، جنہوں نے انہیں غیر اخلاقی کاموں سے خبردار کیا۔"
  },
  {
    "arabic": "إسماعيل",
    "urdu": "اسماعیل",
    "transliteration": "Isma'il (Ishmael)",
    "english_intro": "Son of Ibrahim, he is associated with the building of the Kaaba in Mecca and the ritual of sacrifice (Qurbani).",
    "urdu_intro": "ابراہیم کے بیٹے، ان کا تعلق مکہ میں کعبہ کی تعمیر اور قربانی کے رسم سے ہے۔"
  },
  {
    "arabic": "إسحاق",
    "urdu": "اسحاق",
    "transliteration": "Ishaq (Isaac)",
    "english_intro": "Son of Ibrahim and father of Ya'qub. He continued his father's mission of propagating monotheism.",
    "urdu_intro": "ابراہیم کے بیٹے اور یعقوب کے والد۔ انہوں نے توحید کی تبلیغ کا اپنے والد کا مشن جاری رکھا۔"
  },
  {
    "arabic": "يعقوب",
    "urdu": "یعقوب",
    "transliteration": "Ya'qub (Jacob)",
    "english_intro": "Also known as Israel, he was the father of the 12 tribes of Israel.",
    "urdu_intro": "اسرائیل کے نام سے بھی جانے جاتے ہیں، آپ بنی اسرائیل کے 12 قبیلوں کے والد تھے۔"
  },
  {
    "arabic": "يوسف",
    "urdu": "یوسف",
    "transliteration": "Yusuf (Joseph)",
    "english_intro": "Known for his beauty, righteous character, and ability to interpret dreams. His story is detailed in an entire chapter of the Quran.",
    "urdu_intro": "اپنی خوبصورتی، نیک سیرت اور خوابوں کی تعبیر کی صلاحیت کے لیے مشہور ہیں۔ ان کا قصہ قرآن کے ایک پورے باب میں تفصیل سے بیان کیا گیا ہے۔"
  },
  {
    "arabic": "أيوب",
    "urdu": "ایوب",
    "transliteration": "Ayyub (Job)",
    "english_intro": "Known for his patience and perseverance through severe trials of health and wealth.",
    "urdu_intro": "صحت اور دولت کی شدید آزمائشوں میں اپنے صبر اور استقامت کے لیے مشہور ہیں۔"
  },
  {
    "arabic": "شعيب",
    "urdu": "شعیب",
    "transliteration": "Shu'aib (Jethro)",
    "english_intro": "Sent to the people of Madyan, who were corrupt in their business dealings and measurements.",
    "urdu_intro": "قومِ مدین کی طرف بھیجے گئے، جو اپنے کاروباری معاملات اور پیمائش میں بدعنوان تھے۔"
  },
  {
    "arabic": "موسى",
    "urdu": "موسیٰ",
    "transliteration": "Musa (Moses)",
    "english_intro": "Received the Tawrat (Torah) and is one of the most frequently mentioned prophets, known for confronting Pharaoh.",
    "urdu_intro": "تورات (Tawrat) عطا کی گئی اور یہ کثرت سے ذکر کیے جانے والے انبیاء میں سے ہیں، جو فرعون کا مقابلہ کرنے کے لیے مشہور ہیں۔"
  },
  {
    "arabic": "هارون",
    "urdu": "ہارون",
    "transliteration": "Harun (Aaron)",
    "english_intro": "Brother of Musa, he was an eloquent speaker and served as Musa's helper and deputy in guiding the Israelites.",
    "urdu_intro": "موسیٰ کے بھائی، وہ ایک فصیح و بلیغ مقرر تھے اور بنی اسرائیل کی رہنمائی میں موسیٰ کے مددگار اور نائب کے طور پر خدمات انجام دیں۔"
  },
  {
    "arabic": "ذو الكفل",
    "urdu": "ذوالکفل",
    "transliteration": "Dhu'l-kifl (Ezekiel)",
    "english_intro": "Known for his steadfastness and commitment to the truth and God's commands.",
    "urdu_intro": "سچائی اور اللہ کے احکامات پر اپنی ثابت قدمی اور پختہ عزم کے لیے جانے جاتے ہیں۔"
  },
  {
    "arabic": "داود",
    "urdu": "داؤد",
    "transliteration": "Dawud (David)",
    "english_intro": "A king and prophet who was granted the Zabur (Psalms). He famously defeated Goliath.",
    "urdu_intro": "ایک بادشاہ اور نبی جنہیں زبور (Zabur) عطا کی گئی تھی۔ انہوں نے مشہور زمانہ طور پر جالوت کو شکست دی۔"
  },
  {
    "arabic": "سليمان",
    "urdu": "سلیمان",
    "transliteration": "Sulaiman (Solomon)",
    "english_intro": "Son of Dawud, he was a powerful king and prophet to whom God granted control over the wind and jinn.",
    "urdu_intro": "داؤد کے بیٹے، وہ ایک طاقتور بادشاہ اور نبی تھے جنہیں اللہ نے ہوا اور جنوں پر کنٹرول عطا کیا۔"
  },
  {
    "arabic": "إلياس",
    "urdu": "الیاس",
    "transliteration": "Ilias (Elias)",
    "english_intro": "Sent to people who worshipped idols, urging them to abandon the worship of the idol Ba'l.",
    "urdu_intro": "بتوں کی پوجا کرنے والوں کی طرف بھیجے گئے، اور انہیں بت 'بعل' کی عبادت چھوڑنے کی تلقین کی۔"
  },
  {
    "arabic": "اليسع",
    "urdu": "الیسع",
    "transliteration": "Al-Yasa (Elisha)",
    "english_intro": "A successor to Ilias, he continued his mission to guide his people back to the worship of the One God.",
    "urdu_intro": "الیاس کے جانشین، انہوں نے اپنی قوم کو ایک خدا کی عبادت کی طرف واپس لانے کا اپنا مشن جاری رکھا۔"
  },
  {
    "arabic": "يونس",
    "urdu": "یونس",
    "transliteration": "Yunus (Jonah)",
    "english_intro": "Known for being swallowed by a great fish and subsequently repenting and being saved.",
    "urdu_intro": "ایک بڑی مچھلی کے نگل جانے، اس کے بعد توبہ کرنے اور نجات پانے کے لیے مشہور ہیں۔"
  },
  {
    "arabic": "زكريا",
    "urdu": "زکریا",
    "transliteration": "Zakariyya (Zechariah)",
    "english_intro": "A righteous man and prophet, known for praying for a son in his old age, who became the prophet Yahya.",
    "urdu_intro": "ایک نیک اور نبی جو بڑھاپے میں بیٹے کے لیے دعا کرنے کے لیے جانے جاتے ہیں، جو بعد میں نبی یحییٰ بنے۔"
  },
  {
    "arabic": "يحيى",
    "urdu": "یحییٰ",
    "transliteration": "Yahya (John)",
    "english_intro": "Son of Zakariyya, he was known for his piety and was a forerunner for Isa (Jesus).",
    "urdu_intro": "زکریا کے بیٹے، وہ اپنی پرہیزگاری کے لیے مشہور تھے اور عیسیٰ (عیسیٰ) کے پیش رو تھے۔"
  },
  {
    "arabic": "عيسى",
    "urdu": "عیسیٰ",
    "transliteration": "Isa (Jesus)",
    "english_intro": "Born miraculously to Maryam (Mary), he was granted the Injil (Gospel) and performed many miracles.",
    "urdu_intro": "مریم کے معجزاتی طور پر پیدا ہوئے، انہیں انجیل (Injil) عطا کی گئی اور انہوں نے بہت سے معجزات دکھائے۔"
  },
  {
    "arabic": "محمد ﷺ",
    "urdu": "محمد ﷺ",
    "transliteration": "Muhammad ﷺ",
    "english_intro": "The Final Prophet (Seal of the Prophets) to all of mankind, who received the Quran, the final divine revelation.",
    "urdu_intro": "تمام بنی نوع انسان کے لیے آخری نبی (خاتم النبیین)، جنہیں قرآن، آخری آسمانی وحی، عطا کی گئی۔"
  }
]
