[
  {
    "hadith_number": "Sahih al-Bukhari 505",
    "chapter": "Times of the Prayers",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abdullah: I asked the Prophet 'Which deed is the dearest to Allah?' He replied, 'To offer the prayers at their early stated fixed times.' I asked, 'What is the next (in goodness)?' He replied, 'To be good and dutiful to your parents.'",
    "urdu_text": "عبداللہ رضی اللہ عنہ سے روایت ہے کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا: 'اللہ کو سب سے زیادہ کون سا عمل پیارا ہے؟' آپ نے فرمایا: 'نماز کو اس کے مقررہ وقت پر ادا کرنا۔' میں نے پوچھا: 'اس کے بعد کون سا؟' آپ نے فرمایا: 'والدین کے ساتھ حسن سلوک کرنا۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 572",
    "chapter": "Times of the Prayers",
    "topic": "Sin of Missing Prayer",
    "text": "Narrated by Anas ibn Malik: The Prophet (ﷺ) said: 'Whoever forgets a prayer, let him offer it as soon as he remembers, for there is no expiation for it other than that.'",
    "urdu_text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: 'جو شخص نماز بھول جائے، تو وہ اسے جب یاد آئے تب ادا کر لے، کیونکہ اس کا کوئی کفارہ نہیں ہے سوائے اس کے۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 349",
    "chapter": "Prayers (Salat)",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Anas ibn Malik: 'Allah enjoined fifty prayers on my followers when I returned with this order of Allah, I passed by Moses who asked me, 'What has Allah enjoined on your followers?' When I passed by Moses again and informed him about it, he said, 'Go back to your Lord, for your followers will not be able to bear it.' So I returned to Allah and He said, 'These are five prayers and they are all (equal to) fifty (in reward) for My Word does not change.'",
    "urdu_text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ جب میں اس حکم کے ساتھ واپس آیا تو مجھ پر اللہ نے پچاس نمازیں فرض کیں۔ میں موسیٰ علیہ السلام کے پاس سے گزرا، انہوں نے مجھ سے پوچھا: 'اللہ نے آپ کی امت پر کیا فرض کیا ہے؟' جب میں نے دوبارہ موسیٰ علیہ السلام کو اس کی خبر دی، تو انہوں نے کہا: 'اپنے رب کے پاس واپس جائیے، کیونکہ آپ کی امت اس کی طاقت نہیں رکھتی۔' چنانچہ میں اللہ کے پاس واپس گیا اور اس نے فرمایا: 'یہ پانچ نمازیں ہیں اور یہ سب (ثواب میں) پچاس کے برابر ہیں، کیونکہ میرا کلام تبدیل نہیں ہوتا۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 615",
    "chapter": "Times of the Prayers",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abu Huraira: 'The reward of the prayer offered by people in congregation is twenty-five times greater than that of the prayer offered by a person alone.'",
    "urdu_text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ جماعت کے ساتھ پڑھی جانے والی نماز کا ثواب اکیلے پڑھنے والے کی نماز سے پچیس گنا زیادہ ہے۔"
  },
  {
    "hadith_number": "Sahih al-Bukhari 509",
    "chapter": "Times of the Prayers",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Anas: The Prophet (ﷺ) said, 'Do the prostration properly and do not put your fore-arms flat with elbows touching the ground like a dog. And if you want to spit, do not spit in front, nor to the right for the person in prayer is speaking in private to his Lord.'",
    "urdu_text": "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: 'سجدہ صحیح طریقے سے کرو اور اپنے بازو کتے کی طرح زمین پر نہ بچھاؤ۔ اور اگر تم تھوکنا چاہو تو سامنے یا دائیں طرف نہ تھوکو، کیونکہ نماز میں انسان اپنے رب سے سرگوشی کر رہا ہوتا ہے۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 506",
    "chapter": "Times of the Prayers",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abu Huraira: I heard Allah's Messenger (ﷺ) saying, 'If there was a river at the door of anyone of you and he took a bath in it five times a day, would you notice any dirt on him?' They said, 'Not a trace of dirt would be left.' The Prophet (ﷺ) added, 'That is the example of the five prayers with which Allah blots out (annuls) evil deeds.'",
    "urdu_text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا: 'اگر کسی کے دروازے پر ایک نہر ہو اور وہ اس میں دن میں پانچ بار غسل کرے، تو کیا تم اس کے جسم پر کوئی میل دیکھو گے؟' انہوں نے کہا: 'میل کا کوئی نشان باقی نہیں رہے گا۔' نبی صلی اللہ علیہ وسلم نے مزید فرمایا: 'یہ پانچ نمازوں کی مثال ہے جس سے اللہ گناہوں کو مٹا دیتا ہے۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 658",
    "chapter": "Adhan (The Call to Prayer)",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abu Said Al-Khudri: The Prophet (ﷺ) said, 'Whoever hears the call to prayer and does not respond, there is no prayer for him, unless he has a valid excuse.'",
    "urdu_text": "ابوسعید الخدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: 'جو شخص اذان کی آواز سنے اور اس کا جواب نہ دے، اس کے لیے کوئی نماز نہیں ہے، سوائے اس کے کہ اس کے پاس کوئی معقول عذر ہو۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 1125",
    "chapter": "The Book of Tahajjud",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Anas ibn Malik: 'The Prophet (ﷺ) said, 'The difference between us and the people of the Book is the prayer. So whoever abandons it has committed disbelief.'",
    "urdu_text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: 'ہمارے اور اہل کتاب کے درمیان فرق نماز ہے۔ پس جس نے اسے چھوڑ دیا، اس نے کفر کیا۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 682",
    "chapter": "Adhan (The Call to Prayer)",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abu Huraira: 'A man entered the mosque and prayed while Allah's Messenger (ﷺ) was sitting in a corner of the mosque. The man came and greeted him. The Prophet (ﷺ) said, 'Go back and pray, for you have not prayed.' The man went back, prayed, and came again and greeted him. The Prophet (ﷺ) said, 'Go back and pray, for you have not prayed.' This happened thrice.'",
    "urdu_text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ ایک آدمی مسجد میں داخل ہوا اور نماز پڑھی، جبکہ رسول اللہ صلی اللہ علیہ وسلم مسجد کے ایک کونے میں بیٹھے تھے۔ وہ آدمی آیا اور آپ کو سلام کیا۔ نبی صلی اللہ علیہ وسلم نے فرمایا: 'واپس جاؤ اور نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی۔' وہ آدمی واپس گیا، نماز پڑھی اور دوبارہ آیا اور سلام کیا۔ نبی صلی اللہ علیہ وسلم نے فرمایا: 'واپس جاؤ اور نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی۔' یہ تین مرتبہ ہوا۔"
  },
  {
    "hadith_number": "Sahih al-Bukhari 767",
    "chapter": "The Call to Prayer",
    "topic": "Sin of Missing Prayer",
    "text": "Narrated by 'Aisha: The Prophet (ﷺ) said, 'A person who sleeps and misses the prayer, or forgets it, let him pray it when he remembers it.'",
    "urdu_text": "عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: 'جو شخص سو جائے اور اس سے نماز چھوٹ جائے، یا وہ بھول جائے، تو وہ جب اسے یاد آئے تب ادا کر لے۔'"
  },
  {
    "hadith_number": "Sahih al-Bukhari 556",
    "chapter": "Times of the Prayers",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abu Huraira: The Prophet (ﷺ) said, 'Whoever prays the Fajr prayer is under the protection of Allah.'",
    "urdu_text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: 'جو شخص فجر کی نماز پڑھتا ہے، وہ اللہ کی پناہ میں ہوتا ہے۔'"
  }
]
