[
{
"hadith_number": "Sahih al-Bukhari 505",
"chapter": "Times of the Prayers",
"topic": "Benefits of Prayer",
"text": "Narrated by Abdullah: I asked the Prophet 'Which deed is the dearest to Allah?' He replied, 'To offer the prayers at their early stated fixed times.' I asked, 'What is the next (in goodness)?' He replied, 'To be good and dutiful to your parents.'"
},
{
"hadith_number": "Sahih al-Bukhari 572",
"chapter": "Times of the Prayers",
"topic": "Sin of Missing Prayer",
"text": "Narrated by Anas ibn Malik: The Prophet (ﷺ) said: 'Whoever forgets a prayer, let him offer it as soon as he remembers, for there is no expiation for it other than that.'"
},
{
"hadith_number": "Sahih al-Bukhari 349",
"chapter": "Prayers (Salat)",
"topic": "Benefits of Prayer",
"text": "Narrated by Anas ibn Malik: 'Allah enjoined fifty prayers on my followers when I returned with this order of Allah, I passed by Moses who asked me, 'What has Allah enjoined on your followers?' When I passed by Moses again and informed him about it, he said, 'Go back to your Lord, for your followers will not be able to bear it.' So I returned to Allah and He said, 'These are five prayers and they are all (equal to) fifty (in reward) for My Word does not change.'"
},
{
"hadith_number": "Sahih al-Bukhari 615",
"chapter": "Times of the Prayers",
"topic": "Benefits of Prayer",
"text": "Narrated by Abu Huraira: 'The reward of the prayer offered by people in congregation is twenty-five times greater than that of the prayer offered by a person alone.'"
},
{
"hadith_number": "Sahih al-Bukhari 509",
"chapter": "Times of the Prayers",
"topic": "Benefits of Prayer",
"text": "Narrated by Anas: The Prophet (ﷺ) said, 'Do the prostration properly and do not put your fore-arms flat with elbows touching the ground like a dog. And if you want to spit, do not spit in front, nor to the right for the person in prayer is speaking in private to his Lord.'"
},
{
"hadith_number": "Sahih al-Bukhari 506",
"chapter": "Times of the Prayers",
"topic": "Benefits of Prayer",
"text": "Narrated by Abu Huraira: I heard Allah's Messenger (ﷺ) saying, 'If there was a river at the door of anyone of you and he took a bath in it five times a day, would you notice any dirt on him?' They said, 'Not a trace of dirt would be left.' The Prophet (ﷺ) added, 'That is the example of the five prayers with which Allah blots out (annuls) evil deeds.'"
},
{
"hadith_number": "Sahih al-Bukhari 658",
"chapter": "Adhan (The Call to Prayer)",
"topic": "Benefits of Prayer",
"text": "Narrated by Abu Said Al-Khudri: The Prophet (ﷺ) said, 'Whoever hears the call to prayer and does not respond, there is no prayer for him, unless he has a valid excuse.'"
},
{
"hadith_number": "Sahih al-Bukhari 1125",
"chapter": "The Book of Tahajjud",
"topic": "Benefits of Prayer",
"text": "Narrated by Anas ibn Malik: 'The Prophet (ﷺ) said, 'The difference between us and the people of the Book is the prayer. So whoever abandons it has committed disbelief.'"
},
{
"hadith_number": "Sahih al-Bukhari 682",
"chapter": "Adhan (The Call to Prayer)",
"topic": "Benefits of Prayer",
"text": "Narrated by Abu Huraira: 'A man entered the mosque and prayed while Allah's Messenger (ﷺ) was sitting in a corner of the mosque. The man came and greeted him. The Prophet (ﷺ) said, 'Go back and pray, for you have not prayed.' The man went back, prayed, and came again and greeted him. The Prophet (ﷺ) said, 'Go back and pray, for you have not prayed.' This happened thrice.'"
},
{
"hadith_number": "Sahih al-Bukhari 767",
"chapter": "The Call to Prayer",
"topic": "Sin of Missing Prayer",
"text": "Narrated by 'Aisha: The Prophet (ﷺ) said, 'A person who sleeps and misses the prayer, or forgets it, let him pray it when he remembers it.'"
},
  {
    "hadith_number": "Sahih al-Bukhari 556",
    "chapter": "Times of the Prayers",
    "topic": "Benefits of Prayer",
    "text": "Narrated by Abu Huraira: The Prophet (ﷺ) said, 'Whoever prays the Fajr prayer is under the protection of Allah.'"
  }
]